Log/first_request.xml

<?xml version='1.0' encoding='UTF-8'?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:typ="urn://x-artefacts-smev-gov-ru/services/service-adapter/types"><soapenv:Header /><soapenv:Body><tns:ClientMessage xmlns:n1="http://www.altova.com/samplexml/other-namespace" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:tns="urn://x-artefacts-smev-gov-ru/services/service-adapter/types" xsi:schemaLocation="urn://x-artefacts-smev-gov-ru/services/message-exchange/types/1.2"><tns:itSystem>77AB01</tns:itSystem><tns:RequestMessage><tns:RequestMetadata><tns:clientId>badf3a68-25c3-49b7-95a9-936a9cdb5cae</tns:clientId><tns:createGroupIdentity><tns:FRGUServiceCode>00000000000000000000</tns:FRGUServiceCode><tns:FRGUServiceDescription>00000000000000000000</tns:FRGUServiceDescription><tns:FRGUServiceRecipientDescription>00000000000000000000</tns:FRGUServiceRecipientDescription></tns:createGroupIdentity><tns:testMessage>false</tns:testMessage></tns:RequestMetadata><RequestContent><content><MessagePrimaryContent><tns:FNSPaspINNRequest xmlns:tns="urn://x-artefacts-ffns-paspinn-tofns-ru/247-01/4.0.0" ИННФЛ="292500341781"><tns:ФИО FamilyName="Ситникова" FirstName="Мария" Patronymic="Григорьевна" /><tns:ДокУдЛичн DocumentCode="21" IssuerDate="2022-07-16" SeriesNumber="46 22 668542" /></tns:FNSPaspINNRequest></MessagePrimaryContent></content></RequestContent></tns:RequestMessage></tns:ClientMessage></soapenv:Body></soapenv:Envelope>